In [ ]:
! pip install pyspark

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting pyspark
  Downloading pyspark-3.4.0.tar.gz (310.8 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 310.8/310.8 MB 4.1 MB/s eta 0:00:00
  Preparing metadata (setup.py) ... done
Requirement already satisfied: py4j==0.10.9.7 in /usr/local/lib/python3.10/dist-packages (from pyspark) (0.10.9.7)
Building wheels for collected packages: pyspark
  Building wheel for pyspark (setup.py) ... done
  Created wheel for pyspark: filename=pyspark-3.4.0-py2.py3-none-any.whl size=311317145 sha256=564657f255ea3812fe1bcf9665ae578114bdaff35368ec2dc4b136ae48589c9a
  Stored in directory: /root/.cache/pip/wheels/7b/1b/4b/3363a1d04368e7ff0d408e57ff57966fcdf00583774e761327
Successfully built pyspark
Installing collected packages: pyspark
Successfully installed pyspark-3.4.0

In [ ]:
from pyspark import SparkContext, SparkConf

In [ ]:
appName="lab12"
master="local[*]"

In [ ]:
conf = SparkConf().setAppName(appName).setMaster(master)
sc = SparkContext(conf=conf)

Task 1

In [ ]:
rdd1=sc.textFile("emp1.txt")
rdd2=sc.textFile("emp2.txt")
rdd3 = rdd1.map(lambda word: (word.split(",")[0],(word.split(",")[1],(word.split(",")[2]))))
rdd4 = rdd2.map(lambda word: (word.split(",")[0],(word.split(",")[1],(word.split(",")[2]))))
sorted(rdd3.join(rdd4).collect())

[('1', (('John', 'Digital Marketing'), ('50000', '2'))),
 ('10', (('Emily', 'Software Development'), ('70000', '5'))),
 ('11', (('James', 'Finance'), ('60000', '3'))),
 ('12', (('Benjamin', 'Digital Marketing'), ('45000', '1'))),
 ('13', (('Emma', 'Software Development'), ('85000', '7'))),
 ('14', (('Ava', 'Data Science'), ('75000', '4'))),
 ('15', (('Isabella', 'Human Resources'), ('70000', '2'))),
 ('16', (('Lucas', 'Finance'), ('80000', '3'))),
 ('17', (('Avery', 'Software Development'), ('55000', '1'))),
 ('18', (('Grace', 'Data Science'), ('65000', '4'))),
 ('19', (('Ethan', 'Human Resources'), ('60000', '2'))),
 ('2', (('Alice', 'Software Development'), ('65000', '5'))),
 ('20', (('Scarlett', 'Software Development'), ('70000', '3'))),
 ('21', (('Henry', 'Digital Marketing'), ('55000', '1'))),
 ('22', (('Amelia', 'Finance'), ('80000', '4'))),
 ('23', (('David', 'Software Development'), ('65000', '3'))),
 ('24', (('Chloe', 'Data Science'), ('70000', '2'))),
 ('25', (('Sebastian', 'Human Resources'), ('60000', '3'))),
 ('26', (('Samuel', 'Finance'), ('75000', '4'))),
 ('27', (('Evelyn', 'Software Development'), ('80000', '5'))),
 ('28', (('Jackson', 'Data Science'), ('85000', '6'))),
 ('29', (('Abigail', 'Digital Marketing'), ('50000', '2'))),
 ('3', (('Bob', 'Data Science'), ('70000', '3'))),
 ('30', (('Harper', 'Software Development'), ('70000', '4'))),
 ('31', (('Luna', 'Data Science'), ('55000', '1'))),
 ('32', (('William', 'Human Resources'), ('60000', '3'))),
 ('33', (('Addison', 'Finance'), ('65000', '2'))),
 ('34', (('Charlotte', 'Software Development'), ('75000', '4'))),
 ('35', (('Matthew', 'Data Science'), ('70000', '3'))),
 ('36', (('Mia', 'Human Resources'), ('60000', '2'))),
 ('37', (('Aubrey', 'Software Development'), ('55000', '1'))),
 ('38', (('Elizabeth', 'Finance'), ('80000', '4'))),
 ('39', (('Andrew', 'Data Science'), ('75000', '3'))),
 ('4', (('Charlie', 'Human Resources'), ('55000', '1'))),
 ('40', (('Sofia', 'Human Resources'), ('70000', '2'))),
 ('41', (('Grace', 'Software Development'), ('55000', '1'))),
 ('42', (('Ella', 'Data Science'), ('80000', '3'))),
 ('43', (('Daniel', 'Finance'), ('65000', '2'))),
 ('44', (('Luke', 'Software Development'), ('70000', '4'))),
 ('45', (('Victoria', 'Data Science'), ('60000', '3'))),
 ('46', (('Jack', 'Human Resources'), ('75000', '2'))),
 ('47', (('Julia', 'Software Development'), ('80000', '4'))),
 ('48', (('Jonathan', 'Finance'), ('85000', '5'))),
 ('49', (('John', 'Data Science'), ('70000', '3'))),
 ('5', (('Eve', 'Finance'), ('60000', '4'))),
 ('50', (('Emma', 'Software Development'), ('60000', '2'))),
 ('6', (('Michael', 'Software Development'), ('80000', '6'))),
 ('7', (('Olivia', 'Data Science'), ('90000', '3'))),
 ('8', (('Sophia', 'Finance'), ('75000', '2'))),
 ('9', (('Liam', 'Data Science'), ('55000', '4'))),
 ('emp_id', (('emp_name', 'emp_dept'), ('emp_salary', 'emp_experience')))]

Task 2

In [ ]:
rdd5=sorted(rdd3.leftOuterJoin(rdd4).collect())
rdd5

[('1', (('John', 'Digital Marketing'), ('50000', '2'))),
 ('10', (('Emily', 'Software Development'), ('70000', '5'))),
 ('11', (('James', 'Finance'), ('60000', '3'))),
 ('12', (('Benjamin', 'Digital Marketing'), ('45000', '1'))),
 ('13', (('Emma', 'Software Development'), ('85000', '7'))),
 ('14', (('Ava', 'Data Science'), ('75000', '4'))),
 ('15', (('Isabella', 'Human Resources'), ('70000', '2'))),
 ('16', (('Lucas', 'Finance'), ('80000', '3'))),
 ('17', (('Avery', 'Software Development'), ('55000', '1'))),
 ('18', (('Grace', 'Data Science'), ('65000', '4'))),
 ('19', (('Ethan', 'Human Resources'), ('60000', '2'))),
 ('2', (('Alice', 'Software Development'), ('65000', '5'))),
 ('20', (('Scarlett', 'Software Development'), ('70000', '3'))),
 ('21', (('Henry', 'Digital Marketing'), ('55000', '1'))),
 ('22', (('Amelia', 'Finance'), ('80000', '4'))),
 ('23', (('David', 'Software Development'), ('65000', '3'))),
 ('24', (('Chloe', 'Data Science'), ('70000', '2'))),
 ('25', (('Sebastian', 'Human Resources'), ('60000', '3'))),
 ('26', (('Samuel', 'Finance'), ('75000', '4'))),
 ('27', (('Evelyn', 'Software Development'), ('80000', '5'))),
 ('28', (('Jackson', 'Data Science'), ('85000', '6'))),
 ('29', (('Abigail', 'Digital Marketing'), ('50000', '2'))),
 ('3', (('Bob', 'Data Science'), ('70000', '3'))),
 ('30', (('Harper', 'Software Development'), ('70000', '4'))),
 ('31', (('Luna', 'Data Science'), ('55000', '1'))),
 ('32', (('William', 'Human Resources'), ('60000', '3'))),
 ('33', (('Addison', 'Finance'), ('65000', '2'))),
 ('34', (('Charlotte', 'Software Development'), ('75000', '4'))),
 ('35', (('Matthew', 'Data Science'), ('70000', '3'))),
 ('36', (('Mia', 'Human Resources'), ('60000', '2'))),
 ('37', (('Aubrey', 'Software Development'), ('55000', '1'))),
 ('38', (('Elizabeth', 'Finance'), ('80000', '4'))),
 ('39', (('Andrew', 'Data Science'), ('75000', '3'))),
 ('4', (('Charlie', 'Human Resources'), ('55000', '1'))),
 ('40', (('Sofia', 'Human Resources'), ('70000', '2'))),
 ('41', (('Grace', 'Software Development'), ('55000', '1'))),
 ('42', (('Ella', 'Data Science'), ('80000', '3'))),
 ('43', (('Daniel', 'Finance'), ('65000', '2'))),
 ('44', (('Luke', 'Software Development'), ('70000', '4'))),
 ('45', (('Victoria', 'Data Science'), ('60000', '3'))),
 ('46', (('Jack', 'Human Resources'), ('75000', '2'))),
 ('47', (('Julia', 'Software Development'), ('80000', '4'))),
 ('48', (('Jonathan', 'Finance'), ('85000', '5'))),
 ('49', (('John', 'Data Science'), ('70000', '3'))),
 ('5', (('Eve', 'Finance'), ('60000', '4'))),
 ('50', (('Emma', 'Software Development'), ('60000', '2'))),
 ('6', (('Michael', 'Software Development'), ('80000', '6'))),
 ('7', (('Olivia', 'Data Science'), ('90000', '3'))),
 ('8', (('Sophia', 'Finance'), ('75000', '2'))),
 ('9', (('Liam', 'Data Science'), ('55000', '4'))),
 ('emp_id', (('emp_name', 'emp_dept'), ('emp_salary', 'emp_experience')))]

TASK 4

In [ ]:
rdd2=sc.textFile("emp2.txt")
rdd4 = rdd2.map(lambda word: (word.split(",")[0],(word.split(",")[1])))
rdd4.collect()

[('emp_id', 'emp_salary'),
 ('1', '50000'),
 ('2', '65000'),
 ('3', '70000'),
 ('4', '55000'),
 ('5', '60000'),
 ('6', '80000'),
 ('7', '90000'),
 ('8', '75000'),
 ('9', '55000'),
 ('10', '70000'),
 ('11', '60000'),
 ('12', '45000'),
 ('13', '85000'),
 ('14', '75000'),
 ('15', '70000'),
 ('16', '80000'),
 ('17', '55000'),
 ('18', '65000'),
 ('19', '60000'),
 ('20', '70000'),
 ('21', '55000'),
 ('22', '80000'),
 ('23', '65000'),
 ('24', '70000'),
 ('25', '60000'),
 ('26', '75000'),
 ('27', '80000'),
 ('28', '85000'),
 ('29', '50000'),
 ('30', '70000'),
 ('31', '55000'),
 ('32', '60000'),
 ('33', '65000'),
 ('34', '75000'),
 ('35', '70000'),
 ('36', '60000'),
 ('37', '55000'),
 ('38', '80000'),
 ('39', '75000'),
 ('40', '70000'),
 ('41', '55000'),
 ('42', '80000'),
 ('43', '65000'),
 ('44', '70000'),
 ('45', '60000'),
 ('46', '75000'),
 ('47', '80000'),
 ('48', '85000'),
 ('49', '70000'),
 ('50', '60000')]

Task 5

In [ ]:
rdd11 = rdd1.map(lambda x: x.split(','))
rdd22 = rdd2.map(lambda x: x.split(','))
rdd12=rdd11.filter(lambda x:x[0][0])
rdd21=rdd22.filter(lambda x:x[0][0])
rdd6=rdd21.join(rdd12)
rdd7=rdd6.map(lambda x:x[1:3])
rdd7.collect()

[(('55000', 'Charlie'),),
 (('70000', 'Emily'),),
 (('45000', 'Benjamin'),),
 (('80000', 'Lucas'),),
 (('70000', 'Scarlett'),),
 (('70000', 'Chloe'),),
 (('75000', 'Samuel'),),
 (('70000', 'Sofia'),),
 (('70000', 'Luke'),),
 (('60000', 'Emma'),),
 (('emp_salary', 'emp_name'),),
 (('70000', 'Bob'),),
 (('80000', 'Michael'),),
 (('90000', 'Olivia'),),
 (('70000', 'Isabella'),),
 (('65000', 'Grace'),),
 (('65000', 'David'),),
 (('60000', 'Sebastian'),),
 (('70000', 'Harper'),),
 (('55000', 'Luna'),),
 (('60000', 'William'),),
 (('60000', 'Mia'),),
 (('80000', 'Ella'),),
 (('65000', 'Daniel'),),
 (('80000', 'Julia'),),
 (('70000', 'John'),),
 (('50000', 'John'),),
 (('75000', 'Sophia'),),
 (('55000', 'Liam'),),
 (('75000', 'Ava'),),
 (('55000', 'Avery'),),
 (('60000', 'Ethan'),),
 (('55000', 'Henry'),),
 (('80000', 'Amelia'),),
 (('50000', 'Abigail'),),
 (('65000', 'Addison'),),
 (('75000', 'Charlotte'),),
 (('60000', 'Victoria'),),
 (('85000', 'Jonathan'),),
 (('65000', 'Alice'),),
 (('60000', 'Eve'),),
 (('60000', 'James'),),
 (('85000', 'Emma'),),
 (('80000', 'Evelyn'),),
 (('85000', 'Jackson'),),
 (('70000', 'Matthew'),),
 (('55000', 'Aubrey'),),
 (('80000', 'Elizabeth'),),
 (('75000', 'Andrew'),),
 (('55000', 'Grace'),),
 (('75000', 'Jack'),)]

Task 6

In [ ]:
rdd8 = rdd11.map(lambda x: (x[0], x[1],x[2]))
nodepart=rdd8.intersection(rdd8)
sorted(nodepart.collect())

[('1', 'John', 'Digital Marketing'),
 ('10', 'Emily', 'Software Development'),
 ('11', 'James', 'Finance'),
 ('12', 'Benjamin', 'Digital Marketing'),
 ('13', 'Emma', 'Software Development'),
 ('14', 'Ava', 'Data Science'),
 ('15', 'Isabella', 'Human Resources'),
 ('16', 'Lucas', 'Finance'),
 ('17', 'Avery', 'Software Development'),
 ('18', 'Grace', 'Data Science'),
 ('19', 'Ethan', 'Human Resources'),
 ('2', 'Alice', 'Software Development'),
 ('20', 'Scarlett', 'Software Development'),
 ('21', 'Henry', 'Digital Marketing'),
 ('22', 'Amelia', 'Finance'),
 ('23', 'David', 'Software Development'),
 ('24', 'Chloe', 'Data Science'),
 ('25', 'Sebastian', 'Human Resources'),
 ('26', 'Samuel', 'Finance'),
 ('27', 'Evelyn', 'Software Development'),
 ('28', 'Jackson', 'Data Science'),
 ('29', 'Abigail', 'Digital Marketing'),
 ('3', 'Bob', 'Data Science'),
 ('30', 'Harper', 'Software Development'),
 ('31', 'Luna', 'Data Science'),
 ('32', 'William', 'Human Resources'),
 ('33', 'Addison', 'Finance'),
 ('34', 'Charlotte', 'Software Development'),
 ('35', 'Matthew', 'Data Science'),
 ('36', 'Mia', 'Human Resources'),
 ('37', 'Aubrey', 'Software Development'),
 ('38', 'Elizabeth', 'Finance'),
 ('39', 'Andrew', 'Data Science'),
 ('4', 'Charlie', 'Human Resources'),
 ('40', 'Sofia', 'Human Resources'),
 ('41', 'Grace', 'Software Development'),
 ('42', 'Ella', 'Data Science'),
 ('43', 'Daniel', 'Finance'),
 ('44', 'Luke', 'Software Development'),
 ('45', 'Victoria', 'Data Science'),
 ('46', 'Jack', 'Human Resources'),
 ('47', 'Julia', 'Software Development'),
 ('48', 'Jonathan', 'Finance'),
 ('49', 'John', 'Data Science'),
 ('5', 'Eve', 'Finance'),
 ('50', 'Emma', 'Software Development'),
 ('6', 'Michael', 'Software Development'),
 ('7', 'Olivia', 'Data Science'),
 ('8', 'Sophia', 'Finance'),
 ('9', 'Liam', 'Data Science'),
 ('emp_id', 'emp_name', 'emp_dept')]

Task 7

In [ ]:
from pyspark.sql import SparkSession

spark = SparkSession.builder.appName("BroadcastJoinExample").getOrCreate()


rdd1= spark.sparkContext.parallelize([(6290, "zamna"), (6284, "laiba"), (5644, "naba"), (7691, "rabiya")])
rdd2= spark.sparkContext.parallelize([(6290, 22), (6284, 19), (5644, 20), (7691, 17)])

broadcast_names = spark.sparkContext.broadcast(rdd1.collect())

result = rdd2.join(rdd1)


result.collect()

[(6284, (19, 'laiba')),
 (5644, (20, 'naba')),
 (6290, (22, 'zamna')),
 (7691, (17, 'rabiya'))]

Task 8

In [ ]:
from pyspark import SparkContext
num=sc.accumulator(0)
def f(x):
  global num
  num+=x

rdd=sc.parallelize([0,1,2,3,4,5,6,7,8,9,10])
rdd.foreach(f)

final=num.value
print("Accumulated value is ->",(final))

Accumulated value is -> 55